JOTISED_LETTERS = 'еёюяи'
CAN_BE_LONG = 'ʂbpfkstrlmngdz'
CONSONANT_LETTERS = {
    'б', 'в', 'г', 'д', 'ж', 'з', 'й', 'к', 'л', 'м', 'н', 'п', 'р', 'с', 'т', 'ф', 'х', 'ц', 'ч', 'ш', 'щ',
}
VOICED_OBSTRUENT_LETTERS = {'б', 'в', 'г', 'д', 'ж', 'з'}

EPI_SYMBOLS = (
    'a', 'b', 'bʲ', 'v', 'vʲ', 'ɡ', 'ɡʲ', 'd', 'dʲ', 'e', 'ʒ', 'z', 'zʲ', 'i', 'j', 'k', 'kʲ', 'l', 'lʲ', 'm', 'mʲ', 'n', 'nʲ', 'o', 'p', 'pʲ', 'r', 'rʲ', 's', 'sʲ', 't', 'tʲ', 'u', 'f', 'fʲ', 'x', 'xʲ', 't͡s', 't͡ɕ', 'ʂ', 'ɕː', 'ɨ', 'ɨ̆', 'd͡ʒ',
)
KNOWN_PHONEMES = frozenset((*EPI_SYMBOLS, '_', '|', '||', 'γ', 'ʐ'))

RU_SYMBOLS = (
    'ё', 'й', 'ц', 'у', 'к', 'е', 'н', 'г', 'ш', 'щ', 'з', 'х', 'ъ', 'ф', 'ы', 'в', 'а', 'п', 'р', 'о', 'л', 'д', 'ж', 'э', 'я', 'ч', 'с', 'м', 'и', 'т', 'ь', 'б', 'ю',
)

RU_VOWEL_SYMBOLS = ('а', 'е', 'ё', 'и', 'о', 'у', 'э', 'ю', 'я', 'ы')

ALPHABET = (
    'a', 'ɑ', 'æ', 'æ.', 'ɐ.', 'ɐ', 'ə', 'ʌ', 'b', 'bʷ', 'bː', 'bːʷ', 'bˠ', 'bʲ', 'bᶣ', 'v', 'vʷ', 'vˠ', 'vʲ', 'vᶣ', 'ɡ', 'ɡʷ', 'ɡˠ', 'ɡʲ', 'ɡᶣ', 'ɡː', 'γ', 'γʷ', 'd', 'dʷ', 'dˠ', 'dʲ', 'dᶣ', 'dː', 'dːʷ', 'dːˠ', 'dʲː', 'dːᶣ', 'ʐ', 'ʐʷ', 'ʐˠ', 'ʑː', 'ʑːʷ', 'ʑːˠ', 'ʑʲː', 'ʑːᶣ', 'd͡ʒ', 'd͡ʒᶣ', 'z', 'zʷ', 'zˠ', 'zʲ', 'zᶣ', 'zː', 'zʲː', 'i', 'ɪ', 'ɪ.', 'j', 'ʝ', 'jʷ', 'jᶣ', 'ʝʷ', 'ʝᶣ', 'k', 'kʷ', 'kˠ', 'kʲ', 'kː', 'kːʷ', 'kʲː', 'kᶣ', 'l', 'lʷ', 'lˠ', 'lʲ', 'lᶣ', 'lː', 'lːʷ', 'lʲː', 'lːᶣ', 'ɫ', 'ɫː', 'ɫʷ', 'm', 'mʷ', 'mˠ', 'mʲ', 'mː', 'mːʷ', 'mʲː', 'mːˠ', 'mᶣ', 'ɱ', 'ɱʲ', 'n', 'nʷ', 'nˠ', 'nʲ', 'nː', 'nːʷ', 'nːˠ', 'nʲː', 'nᶣ', 'o', 'ɵ', 'p', 'pʷ', 'pː', 'pːʷ', 'pʲː', 'pˠ', 'pʲ', 'pᶣ', 'r', 'rʷ', 'rˠ', 'rʲ', 'rː', 'rːʷ', 'rʲː', 'rᶣ', 'r̥', 'r̥ʲ', 's', 'sʷ', 'sˠ', 'sʲ', 'sː', 'sːʷ', 'sʲː', 'sᶣ', 't', 'tʷ', 'tˠ', 'tʲ', 'tː', 'tʲː', 'tᶣ', 'u', 'ʉ', 'ʊ', 'ᵿ', 'f', 'fʷ', 'fˠ', 'fʲ', 'fʲː', 'fᶣ', 'x', 'xʷ', 'xˠ', 'xʲ', 'xᶣ', 't͡s', 't͡sʷ', 't͡sˠ', 't͡sː', 't͡sːʷ', 't͡sːˠ', 'd̻͡z̪', 't͡ɕ', 't͡ɕᶣ', 't͡ɕː', 't͡ɕːᶣ', 'ʂ', 'ʂʷ', 'ʂˠ', 'ʂː', 'ʂːʷ', 'ʂːˠ', 'ɕː', 'ɕːᶣ', 'ɨ', 'ɨ̆', 'ɨ̟', 'ɯ̟ɨ̟', 'ᵻ', 'ɛ', 'e', 'ɪ.', 'ʔ',
)

ZH_SH_TS = (
    'd͡ʒᶣ', 't͡s', 'ʐ', 'ʑʲː', 'ʐʷ', 'd̻͡z̪', 'ʂ', 'ʂː', 'ʑːʷ', 'ʂːʷ', 'ʂːˠ', 'd͡ʒ', 'ʂˠ', 'ʑː', 't͡sˠ', 'ʐˠ', 'ʑːˠ', 'ʂʷ', 'ʑːᶣ', 'd͡ʒˠ', 't͡sʷ',
)

TS = ('t͡s', 't͡sʷ', 't͡sˠ', 'd͡ʒᶣ', 'd͡ʒˠ', 'd̻͡z̪', 'd͡ʒ')

JOTISED = ('j', 'ʲa', 'ʲo', 'ʲu', 'ʲe')

IRREGULAR_EXCEPTIONS = {
    'бог': 'бох',
    'грипп': 'грип',
    'кафе': 'кафэ',
    'коммуналка': 'комуналка',
    'купе': 'купэ',
    'манхеттен': 'манхэттэн',
    'одиннадцать': 'одинацать',
    'отель': 'отэль',
    'петербургский': 'петербуржский',
    'пятьдесят': 'пядесят',
    'россия': 'росия',
    'сегодня': 'севодня',
    'сегодняшний': 'севодняшний',
    'шоссе': 'шоссэ',
}
